codeigniter/ETU4547/ETU4547/app/Models/EmpruntModel.php

SELECT *
FROM `emprunts`
WHERE `livre_id` = 3
ORDER BY `date_emprunt` DESC
 LIMIT 1
---
    public function getDernierEmpruntPourLivre(int $livreId): ?array
    {
        return $this->where('livre_id', $livreId)
            ->orderBy('date_emprunt', 'DESC')
            ->first();