codeigniter/ETU4547/ETU4547/app/Models/LivreModel.php

    public function getLivresPagines(int $parPage = 10, string $sort = 'titre', string $order = 'asc'): array
    {
        $sortColonne = $this->normaliserTri($sort);
        $direction = $this->normaliserOrdre($order);

        return $this->orderBy($sortColonne, $direction)->paginate($parPage);
---
SELECT COUNT(*) AS `numrows`
FROM `livres`