codeigniter/ETU4547/ETU4547/app/Controllers/LibraryController.php

    public function index()
    {
        $motCle = trim((string) $this->request->getGet('mot_cle'));
        $categorie = trim((string) $this->request->getGet('categorie'));
        $sort = trim((string) $this->request->getGet('sort'));
        $order = trim((string) $this->request->getGet('order'));

        $rawCategories = $this->livreModel
            ->select('categorie')
            ->distinct()
            ->where('categorie IS NOT NULL', null, false)
            ->where('categorie !=', '')
            ->orderBy('categorie', 'ASC')
            ->findAll();
---
SELECT DISTINCT `categorie`
FROM `livres`
WHERE categorie IS NOT NULL
AND `categorie` != ''
ORDER BY `categorie` ASC

    public function new()
    {
        $rawCategories = $this->livreModel
            ->select('categorie')
            ->distinct()
            ->where('categorie IS NOT NULL', null, false)
            ->where('categorie !=', '')
            ->orderBy('categorie', 'ASC')
            ->findAll();
---
SELECT DISTINCT `categorie`
FROM `livres`
WHERE categorie IS NOT NULL
AND `categorie` != ''
ORDER BY `categorie` ASC

    public function loan(int $id)
    {
        $livre = $this->livreModel->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 7