codeigniter/ETU4547/ETU4547/app/Controllers/MouvementController.php

    public function loan(int $id)
    {
        $livre = $this->livreModel->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 3

        $this->empruntModel->creerEmprunt($id, $nomEmprunteur);

        // Marquer le livre comme prêté
        $this->livreModel->update($id, [
            'statut' => 'prete',
        ]);
---
UPDATE `livres` SET `statut` = 'prete', `updated_at` = '2026-04-21 13:51:15'
WHERE `livres`.`id` IN (3)

    public function returnBook(int $id)
    {
        $livre = $this->livreModel->find($id);

        if ($livre === null) {
            throw PageNotFoundException::forPageNotFound(self::MESSAGE_LIVRE_INTROUVABLE);
        }

        $empruntActif = $this->empruntModel
            ->where('livre_id', $id)
            ->where('statut', 'actif')
            ->orderBy('date_emprunt', 'DESC')
            ->first();

        if ($empruntActif === null) {
            return redirect()->to(self::ROUTE_LIVRES . $id)->with('error', 'Aucun emprunt actif trouve pour ce livre.');
        }

        // Marquer comme retourné et calculer les retards
        $this->empruntModel->marquerCommeRetourne($empruntActif['id']);

        // Marquer le livre comme disponible
        $this->livreModel->update($id, [
            'statut' => 'disponible',
        ]);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 2
UPDATE `livres` SET `statut` = 'disponible', `updated_at` = '2026-04-22 06:49:46'
WHERE `livres`.`id` IN (2)